OpenFoam/channel_flow/channel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 1.4 0) // 0
    (2.5 1.2 0) // 1
    (3 1 0) // 2
    (5 0.8 0) // 3
    (5.5 0.6 0) // 4
    (7.5 0.4 0) // 5
    (8 0.2 0) // 6
    (10 0 0) // 7
    (10 1.6 0) // 8
    (8 1.6 0) // 9
    (7.5 1.6 0) // 10
    (5.5 1.6 0) // 11
    (5 1.6 0) // 12
    (3 1.6 0) // 13
    (2.5 1.6 0) // 14
    (0 1.6 0) // 15

    (0 1.4 0.01) // 16
    (2.5 1.2 0.01) // 17
    (3 1 0.01) // 18
    (5 0.8 0.01) // 19
    (5.5 0.6 0.01) // 20
    (7.5 0.4 0.01) // 21
    (8 0.2 0.01) // 22
    (10 0 0.01) // 23
    (10 1.6 0.01) // 24
    (8 1.6 0.01) // 25
    (7.5 1.6 0.01) // 26
    (5.5 1.6 0.01) // 27
    (5 1.6 0.01) // 28
    (3 1.6 0.01) // 29
    (2.5 1.6 0.01) // 30
    (0 1.6 0.01) // 31
);

blocks
(
    hex (0 1 14 15 16 17 30 31) (250 160 1) simpleGrading (1 1 1) // 0
    hex (1 2 13 14 17 18 29 30) (50 160 1) simpleGrading (1 1 1) // 1
    hex (2 3 12 13 18 19 28 29) (200 160 1) simpleGrading (1 1 1) // 2
    hex (3 4 11 12 19 20 27 28) (50 160 1) simpleGrading (1 1 1) // 3
    hex (4 5 10 11 20 21 26 27) (200 160 1) simpleGrading (1 1 1) // 4
    hex (5 6 9 10 21 22 25 26) (50 160 1) simpleGrading (1 1 1) // 5
    hex (6 7 8 9 22 23 24 25) (200 160 1) simpleGrading (1 1 1) // 6
);

edges
(
);

boundary
(
    right
    {
        type wall;
        faces
        (
            (8 7 23 24)
        );
    }
    left
    {
        type wall;
        faces
        (
            (0 15 31 16)
        );
    }
    up
    {
        type wall;
        faces
        (
            (15 14 30 31)
            (14 13 29 30)
            (13 12 28 29)
            (12 11 27 28)
	    (11 10 26 27)
            (10 9 25 26)
	    (9 8 24 25)
        );
    }
    down
    {
	type wall;
	faces
	(
	    (0 1 17 16)
	    (1 2 18 17)
	    (2 3 19 18)
	    (3 4 20 19)
	    (4 5 21 20)
	    (5 6 22 21)
	    (6 7 23 22)
	);
    }
    ahead
    {
        type empty;
        faces
        (
            (0 1 14 15)
            (1 2 13 14)
            (2 3 12 13)
	    (3 4 11 12)
	    (4 5 10 11)
	    (5 6 9 10)
	    (6 7 8 9)
        );
    }
    behind
    {
	type empty;
	faces
	(
	   (16 17 30 31)
	   (17 18 29 30)
	   (18 19 28 29)
	   (19 20 27 28)
	   (20 21 26 27)
	   (21 22 25 26)
	   (22 23 24 25)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
