OpenFoam/channel_flow/channel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       318840;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       319000;
    }
    up
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       319160;
    }
    down
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       320160;
    }
    ahead
    {
        type            empty;
        inGroups        1(empty);
        nFaces          160000;
        startFace       321160;
    }
    behind
    {
        type            empty;
        inGroups        1(empty);
        nFaces          160000;
        startFace       481160;
    }
)

// ************************************************************************* //
