OpenFoam/channel_flow/channel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            fixedValue;
	value		uniform (0.5 0 0);
    }
    right
    {
        type            pressureInletOutletVelocity;
	value		uniform (0 0 0);
    }
    up
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }
    down
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    behind
    {
        type            empty;
    }
    ahead
    {
	type		empty;
    }
}


// ************************************************************************* //
