OpenFoam/channel_flow/channel/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    right
    {
        type            totalPressure;
        p0           	uniform 0;
	U		U;
	phi		phi;
	rho		rho;
	psi		none;
	gamma		1;
	value		uniform 0;
    }

    up
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    down
    {
        type            fixedFluxPressure;
        p0              uniform 0;
    }

    ahead
    {
        type            empty;
    }
    
    behind
    {
	type		empty;
    }
}

// ************************************************************************* //
