OpenFoam/channel_flow/channel/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.002;

boundaryField
{
    right
    {
        type            epsilonWallFunction;
        Cmu             0.09;
	kappa		0.41;
	E		9.8;
	value		uniform 0.002;
    }
    left
    {
        type            epsilonWallFunction;
        Cmu		0.09;
	kappa		0.41;
	E		9.8;
	value		uniform 0.002;
    }
    down
    {
        type            epsilonWallFunction;
        Cmu		0.09;
	kappa		0.41;
	E		9.8;
	value		uniform 0.002;
    }
    up
    {
        type            epsilonWallFunction;
        Cmu		0.09;
	kappa		0.41;
	E		9.8;
	value		uniform 0.002;
    }
    ahead
    {
        type            empty;
    }
    behind
    {
	type		empty;
    }
}


// ************************************************************************* //
